# 3. По введенным пользователем координатам двух точек вывести уравнение прямой, проходящей через эти точки

x1 = float(input('Введите x1: '))
y1 = float(input('Введите y1: '))
x2 = float(input('Введите x2: '))
y2 = float(input('Введите y2: '))

if (x1 == x2) and (y1 == y2):
    print(f'Это точка ({x1}, {y1})')
else:
    if x1 == x2:
        print(f'Уравнение x = {x1}')
    else:
        if y1 == y2:
            print(f'Уравнение y = {y1}')
        else:
            k = (y2 - y1)/(x2-x1)
            b = y2 - k*x2
            print(f'Уравнение y = {k}*x + {b}')
